In [2]:
import pandas as pd

In [3]:
# Load the data from CSV file
csv_df = pd.read_csv("CSV_data.csv")
csv_df

       Name   Age         Profession  Salary                    Favorite Quote
0      John  25.0  Software Engineer   80000            Keep calm and code on!
1     Alice   NaN             Doctor  120000           Trust me, I'm a doctor!
2     Rocky   NaN              Boxer   50000                 Eye of the tiger!
3  Sherlock  40.0          Detective  150000  It's elementary, my dear Watson.
4  Mr. Bean  50.0           Comedian   10000                   Why so serious?
5  Mr. Bean  50.0           Comedian   10000                   Why so serious?

In [ ]:
##### Storing the data from dataframe to CSV file
# default index value is true, if index = False then the first index column will be not included in the csv file
csv_df.to_csv("New_csv_data.csv", index = False)x

In [4]:
# Load the data from Excel file
excel_df = pd.read_excel("Excel_data.xlsx")
excel_df

      ID       Name   Age         Profession  salary
0      1     olivia  23.0            Teacher  184518
1      2  sophia     20.0              Boxer  119572
2      3       jake  38.0          Scientist  174897
3      4      Rocky  56.0               Chef  117920
4      4      Rocky  56.0               Chef  117920
..   ...        ...   ...                ...     ...
495  496       John  45.0              Boxer  137929
496  497   Sherlock  46.0              Boxer   39870
497  498   Sherlock  47.0          Detective  165951
498  499     Olivia  55.0           Comedian  192618
499  500   Sherlock  59.0  Software Engineer  194886

[500 rows x 5 columns]

In [10]:
# Storing the data from dataframe to Excel file
# default index value is true, if index = False then the first index column will be not included in the csv file
excel_df.to_excel("New_excel_data.xlsx", index = False)

In [5]:
# Load/Store the data into SQL file
import sqlite3 # it will help to create and connect with SQL Lite database

conn = sqlite3.connect("Profession.db") # create a new database and connecting with it.
csv_df.to_sql("professional_table", conn, if_exists = "replace")

6

In [6]:
df = pd.read_sql("SELECT * FROM Professional_Table", conn)
df

,index,Name,Age,Profession,Salary,Favorite Quote
0,0,John,25.0,Software Engineer,80000,Keep calm and code on!
1,1,Alice,NaN,Doctor,120000,"Trust me, I'm a doctor!"
2,2,Rocky,NaN,Boxer,50000,Eye of the tiger!
3,3,Sherlock,40.0,Detective,150000,"It's elementary, my dear Watson."
4,4,Mr. Bean,50.0,Comedian,10000,Why so serious?
5,5,Mr. Bean,50.0,Comedian,10000,Why so serious?

In [7]:
# Load/Store data from JSON
df = pd.read_json("json_data.json")
df

,order_id,customer_name,food_item,delivery_boy,rating,delivery_time_min
0,101,Ramu,Idli Burger,Speed Shankar,5,15
1,102,Priya,Dosa Pizza,Late Laxman,2,60
2,103,Dinesh,Paneer Sambar,Turbo Thambi,4,25
3,104,Lachu,Mango Maggi,Round Robin,1,90
4,105,Meena,Coconut Coffee,Careless Kannan,3,40

In [11]:
# dataframe to another json file
df.to_json("New_json_data.json",index = False)